/**********************************************************
**0000000000000000000000000000000000000000000000000000000**
**00                                                   00**
**00               东秦节能二队 编写                   00**
**00             队员 ：丰辰 卓然 令闻                 00**
**00                                                   00**
**0000000000000000000000000000000000000000000000000000000**
**00            函数作用：  继电器                     00**
**0000000000000000000000000000000000000000000000000000000**
**********************************************************/

#include "headfile.h"

/**************变量**************/
extern uint16_t dy;
extern uint16_t bbtime;
uint8_t jdq_block = 0;//继电器自锁

/**************函数**************/
void jdq_init(void)
{
  adc_init(ADC0_SE2);//单组电压检测
  gpio_init(H7,GPO,0);//继电器
  jdq_block = 0;
}
void justdo_jdq(void)
{
  if(dy<70 && jdq_block == 0)
  {
    gpio_set(H7,1);
    jdq_block = 1;
    bbtime = 200;
  }
  if(dy<22 && jdq_block == 1)
  {
    gpio_set(H7,0);
  }
}
